{{{header(ulang,
Richard Westhaver,
ellis@rwest.io,
The Universal Language)}}}
#+OPTIONS: toc:t

This document describes a *U-Language* as described by the late great
[[https://iep.utm.edu/haskell-brooks-curry/][Haskell Curry]]:

#+begin_quote
Every investigation, including the present one, has to be communicated
from one person to another by means of language. It is expedient to
begin our study by calling attention to this obvious fact, by giving a
name to the language being used, and by being explicit about a few of
its features. We shall call the language being used the
U-Language. [...] There would be no point in calling attention to it,
if it were not for the fact that language is more intimately related
to our job than of most others.
#+end_quote

In this document, we will be calling attention to our own language -
examining it, and describing how it works.

Our job is to solve problems. Hard problems preferred. So we ought to
pay close attention to the language we use because it brings the
reader and writer /closer/ to the problem at hand.

For starters, we are primarily concerned with /written languages/ like
the one you're reading now. We will skip past the obvious details -
English is our primary form of communication for example. The line you
are reading currently is a sentence which is part of a paragraph.

There are some non-obvious questions which deserve inquiry though.

- *Who is this for?* \\
  This document is for authors and readers alike. It is a loose
  specification, but also serves as introductory material into our
  communication and design philosophy.
  
- *What is this for?* \\
  The purpose of this document is to provide a /standard of
  communication/.

  All sources we write attempt to conform to this standard but this is
  not strictly enforced. If there is a reason to not comply with a
  rule, it is already broken.

** Macros
:PROPERTIES:
:CUSTOM_ID: cdb4976b-1d0d-49df-bfb1-3dbd5d99590e
:END:
Several *global* [[https://orgmode.org/manual/Macro-Replacement.html][Org Macros]] are used throughout our documents. They are listed
here for convenience.

#+name: ulang-macros
#+begin_src emacs-lisp :exports both :results replace pp
  org-export-global-macros
#+end_src

#+RESULTS: ulang-macros
: (("header" .
:   "#+TITLE: $1\n#+AUTHOR: $2\n#+EMAIL: $3\n#+DESCRIPTION: $4\n#+SUBTITLE: $4\n#+OPTIONS: ^:nil toc:nil num:nil html-postamble:nil\n#+HTML_HEAD: <link rel=\"stylesheet\" href=\"https://fonts.xz.style/serve/inter.css\"/>\n#+HTML_HEAD: <link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.compiler.company/css/new.min.css\"/>\n#+HTML_HEAD: <link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.compiler.company/css/night.css\"/>\n")
:  ("opts" . "#+OPTIONS: $1\n"))

Macros /are not expanded/ in source files - you will see them in the
form ={{{NAME(ARGS)}}}=. You will need the relevant macro definition
(in =ulang.el=) in order to use some Org-Mode functions (org-export)
with our docs.

